Feature: Визуализиране на налични оферти за пътуване
   Background: Отваряне на приложението
      Given Отваряне на приложението


  Scenario: Отваряне на начален екран с налични оферти
    Then Визуализира се списък с категории
    And  Визуализира се списък с наличните 7 оферти

  Scenario: Отваряне на начален екран с налични оферти с избор на категория
    When Потребителят избере категория "Автобус"
    Then Визуализира се списък с наличните 3 оферти

  Scenario: Отваряне на начален екран с налични оферти с избор на категория
    When Потребителят избере категория "Влак"
    Then Визуализира се списък с наличните 2 оферти

  Scenario: Отваряне на начален екран с оферти с търсене по име на транспортната фирма
    When Потребителят въвежда "Автобуси до София" в полето за търсене
    And  Натиска бутона за търсене
    Then Визуализира се списък с наличните 1 оферти

  Scenario: Отваряне на начален екран с оферти с търсене по име на транспортната фирма
    When Потребителят въвежда "Автобуси до Пловдив" в полето за търсене
    And  Натиска бутона за търсене
    Then Визуализира се списък с наличните 1 оферти

