 Feature: Оценка на пътуване

   Background:
     Given Потребителят отваря детайлите на "резервация1"

   Scenario: Успешна оценка на резервация
     When Избира 2 звезди
     And Напише коментар "Не много добре"
     And Натисне бутона за оценка
     Then Визуализира се съобщение "Оценихте резервация1 с 2 звезди"


   Scenario: Успешна оценка на резервация без коментар
     When Избира 2 звезди
     And Натисне бутона за оценка
     Then Визуализира се съобщение "Оценихте резервация1 с 2 звезди"

   Scenario: Оценка на резервация с коментар над 60 символа
     When Избира 2 звезди
     And Напише коментар "Нямадакоментирам325907375439806743098573683546398546354386548965489"
     And Натисне бутона за оценка
     Then Визуализира се съобщение "Коментарът трябва да е под 60 символа!"


   Scenario: Оценка на резервация без избор на звезди
     When Напише коментар "Супер"
     And Натисне бутона за оценка
     Then Визуализира се съобщение "Моля, оценете резервацията"


   Scenario: Оценка на резервация с коментар съдържащ забранени символи
     When Избира 2 звезди
     And Напише коментар "Супер <>:@$%€§>"
     And Натисне бутона за оценка
     Then Визуализира се съобщение "Използвате забранени символи"





